app/controllers/dynamic_controller.rb

SELECT "gossips".* FROM "gossips"
SELECT "users".* FROM "users"
---
  def welcome
    @gossips = Gossip.all
    @users = User.all

SELECT "gossips".* FROM "gossips"
---
  def gossip
    @gossips = Gossip.all

SELECT "users".* FROM "users"
---
  def author
    @gossips = Gossip.all
    @users = User.all