app/views/dynamic/gossip.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 218], ["LIMIT", 1]]
---
<h1>Gossip n°<%=params['id']%></h1>
<h2>Auteur : <%="#{@gossips[params['id'].to_i].user.first_name}"%></h2>