app/views/dynamic/welcome.html.erb

        <h5 class="card-title"><%="#{g.title} "%></h5>
        <p class="card-text"><%="#{g.user.first_name}"%></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 211], ["LIMIT", 1]]